
# redis settings.If you use docker-compose, REDIS_HOST = 'redis'
# if some value is empty, set like this: key = ''
REDIS_HOST = '*********'   #redis服务器地址
REDIS_PORT = 6379
REDIS_PASSWORD = '****'
REDIS_DB = 1
REDIS_CHARSET = ''


# scheduler settings
TIMER_RECORDER = 'cbg:scheduler:task'
LOCKER_PREFIX = 'cbg:lock:'

#获取多少分钟的梦幻币
TIMER_MHB = 10

#每隔多长时间跑一次梦幻币（根据服务器火爆程度计算）
TIMER_SERVER_MHB = 2

#如果获取到梦幻币列表最新数据，降低的时间值,单位秒
TIMER_SERVER_DEC = 30

#一次读取多少个服务器的梦幻币
TWICE_PERCENT_MHB = 50

#角色装备数据（支持本地和redis）
ROLEEQUIP = 'cbg:equip+$serverid'

#角色数据
ROLE = 'cbg:role+$serverid'

#灵饰数据
LINGSHI = 'cbg:lingshi+$serverid'

#召唤兽装备
PETEQUIP = 'cbg:petequip+$serverid'

#召唤兽数据
PET = 'cbg:pet+$serverid'

RoleKindNameInfo = {
    1: "逍遥生",
    2: "剑侠客",
    3: "飞燕女",
    4: "英女侠",
    5: "巨魔王",
    6: "虎头怪",
    7: "狐美人",
    8: "骨精灵",
    9: "神天兵",
    10: "龙太子",
    11: "舞天姬",
    12: "玄彩娥",
    203: "巫蛮儿",
    205: "杀破狼",
    209: "羽灵神",
    201: "偃无师",
    207: "鬼潇潇",
    211: "桃夭夭"
}

#男性角色
male = [1,2,5,6,9,10,205,209,201]

#女性角色
female = [3,4,7,8,11,12,203,207,211]


SchoolNameInfo = {
    1: "大唐官府",
    2: "化生寺",
    3: "女儿村",
    4: "方寸山",
    5: "天宫",
    6: "普陀山",
    7: "龙宫",
    8: "五庄观",
    9: "狮驼岭",
    10: "魔王寨",
    11: "阴曹地府",
    12: "盘丝洞",
    13: "神木林",
    14: "凌波城",
    15: "无底洞",
    16: "女魃墓",
    17: "天机城",
    18: "花果山"
}


EquipKinds = {10: '扇', 6: '剑', 14: '刀', 5: '斧', 15: '锤', 4: '枪', 13: '双环', 7: '双剑', 12: '鞭子', 9: '爪刺', 11: '魔棒',
              8: '飘带', 52: '宝珠', 53: '弓箭', 54: '法杖', 18: '男衣', 59: '女衣', 17: '男头', 58: '女头', 20: '腰带', 19: '鞋子',
              21: '饰品', 72: '灯笼', 73: '巨剑', 74: '伞'}

SpecialEffects = {1: "无级别", 2: "简易", 3: "愤怒", 4: "暴怒", 5: "永不磨损", 6: "神农", 7: "神佑", 8: "精致", 9: "坚固", 10: "狩猎",
                  11: "绝杀", 12: "专注", 13: "伪装", 14: "易修理", 15: "再生", 16: "必中", 17: "迷踪", 18: "珍宝"}

SpecialSkills = {1027: "罗汉金钟", 1015: "晶清诀", 1018: "笑里藏刀", 1036: "破血狂攻", 1042: "破碎无双", 1011: "慈航普度", 1008: "四海升平",
                 1014: "玉清诀", 1030: "放下屠刀", 1020: "野兽之力", 1024: "流云诀", 1034: "凝滞术", 1022: "光辉之甲", 1032: "破甲术",
                 1012: "水清诀", 1037: "弱点击破", 2002: "聚精会神", 2004: "燃烧之光", 1010: "起死回生", 1009: "回魂咒", 1023: "圣灵之甲",
                 1033: "碎甲术", 1031: "河东狮吼", 1021: "魔兽之印", 1025: "啸风诀", 1035: "停陷术", 2003: "先发制人", 2007: "菩提心佑",
                 1038: "吸血", 1039: "残月", 1007: "命归术", 1045: "虚空之刃", 1001: "气疗术", 1002: "心疗术", 1003: "命疗术", 1004: "凝气诀",
                 1005: "凝神决", 1006: "气归术", 1013: "冰清诀", 1016: "诅咒之伤", 1017: "诅咒之亡", 1019: "绝幻魔音", 1026: "太极护法",
                 1028: "修罗咒", 1029: "天衣无缝", 1040: "冥王暴杀", "2041,1041": "乾坤斩", 1043: "帝释无双", 1044: "伽罗无双", 1046: "亡灵之刃",
                 1047: "死亡之音", 1048: "身似菩提", 1049: "心如明镜", 1050: "移形换影", 2001: "凝心决", 2005: "毁灭之光", 2006: "金刚不坏"}

SuitEffects = {4011: "变身", 4002: "定心", 4005: "逆鳞", 4008: "幽冥鬼眼", 4016: "一苇渡江", 4004: "金刚护法", 4015: "杀气诀", 4001: "盘丝阵",
               4013: "炼气化神", 4009: "楚楚可怜", 4012: "普渡众生", 4006: "生命之泉", 4007: "魔王回首", 3011: "满天花雨", 3033: "横扫千军",
               4017: "碎星诀", 3050: "浪涌"}

SuitAddedStatus = {
    '变身': 4011,
    '定心术': 4002,
    '逆鳞': 4005,
    '幽冥鬼眼': 4008,
    '一苇渡江': 4016,
    '盘丝阵': 4001,
    '极度疯狂': 4003,
    '金刚护法': 4004,
    '生命之泉': 4006,
    '魔王回首': 4007,
    '楚楚可怜': 4009,
    '百毒不侵': 4010,
    '普渡众生': 4012,
    '炼气化神': 4013,
    '修罗隐身': 4014,
    '杀气诀': 4015,
    '碎星诀': 4017,
    '明光宝烛': 4018
}

SuitAppendSkills = {
    '满天花雨': 3011,
    '知己知彼': 3001,
    '镇妖': 3002,
    '百万神兵': 3003,
    '魔音摄魂': 3004,
    '含情脉脉': 3005,
    '威慑': 3006,
    '催眠符': 3007,
    '失心符': 3008,
    '落魄符': 3009,
    '定身符': 3010,
    '似玉生香': 3012,
    '尸腐毒': 3013,
    '勾魂': 3014,
    '摄魄': 3015,
    '姐妹同心': 3016,
    '唧唧歪歪': 3017,
    '龙卷雨击': 3018,
    '龙腾': 3019,
    '龙吟': 3020,
    '五雷咒': 3021,
    '飞砂走石': 3022,
    '三昧真火': 3023,
    '阎罗令': 3024,
    '判官令': 3025,
    '紧箍咒': 3026,
    '日光华': 3027,
    '靛沧海': 3028,
    '巨岩破': 3029,
    '苍茫树': 3030,
    '地裂火': 3031,
    '后发制人': 3032,
    '横扫千军': 3033,
    '日月乾坤': 3034,
    '无敌牛虱': 3035,
    '雷击': 3036,
    '落岩': 3037,
    '水攻': 3038,
    '烈火': 3039,
    '奔雷咒': 3040,
    '泰山压顶': 3041,
    '水漫金山': 3042,
    '地狱烈火': 3043,
    '落叶萧萧': 3044,
    '尘土刃': 3045,
    '荆棘舞': 3046,
    '冰川怒': 3047,
    '夺命咒': 3048,
    '夺魄令': 3049,
    '浪涌': 3050,
    '裂石': 3051
}

SuitTransformSkills = {
    '巨蛙': 1001,
    '大海龟': 1002,
    '护卫': 1003,
    '树怪': 1004,
    '赌徒': 1005,
    '强盗': 1006,
    '海毛虫': 1007,
    '大蝙蝠': 1008,
    '山贼': 1009,
    '野猪': 1010,
    '骷髅怪': 1011,
    '羊头怪': 1012,
    '蛤蟆精': 1013,
    '狐狸精': 1014,
    '老虎': 1015,
    '黑熊': 1016,
    '花妖': 1017,
    '牛妖': 1018,
    '小龙女': 1019,
    '野鬼': 1020,
    '狼': 1021,
    '虾兵': 1022,
    '蟹将': 1023,
    '龟丞相': 1024,
    '兔子怪': 1025,
    '蜘蛛精': 1026,
    '黑熊精': 1027,
    '僵尸': 1028,
    '牛头': 1029,
    '马面': 1030,
    '雷鸟人': 1031,
    '蝴蝶仙子': 1032,
    '古代瑞兽': 1033,
    '白熊': 1034,
    '黑山老妖': 1035,
    '天兵': 1036,
    '天将': 1037,
    '地狱战神': 1038,
    '风伯': 1039,
    '凤凰': 1040,
    '蛟龙': 1041,
    '雨师': 1042,
    '如意仙子': 1043,
    '芙蓉仙子': 1044,
    '巡游天神': 1045,
    '星灵仙子': 1046,
    '幽灵': 1047,
    '鬼将': 1048,
    '吸血鬼': 1049,
    '净瓶女娲': 1050,
    '律法女娲': 1051,
    '灵符女娲': 1052,
    '画魂': 1053,
    '幽萤娃娃': 1054,
    '大力金刚': 1055,
    '雾中仙': 1056,
    '灵鹤': 1057,
    '夜罗刹': 1058,
    '炎魔神': 1059,
    '噬天虎': 1060,
    '踏云兽': 1061,
    '红萼仙子': 1062,
    '龙龟': 1063,
    '机关兽': 1064,
    '机关鸟': 1065,
    '连弩车': 1066,
    '巴蛇': 1067,
    '葫芦宝贝': 1069,
    '猫灵（人型）': 1070,
    '狂豹（人型）': 1071,
    '蝎子精': 1072,
    '混沌兽': 1073,
    '长眉灵猴': 1074,
    '巨力神猿': 1075,
    '修罗傀儡鬼': 1076,
    '修罗傀儡妖': 1077,
    '金身罗汉': 1078,
    '藤蔓妖花': 1079,
    '曼珠沙华': 1080,
    '蜃气妖': 1081
}

SuitTransformCharms = {
    '巨蛙': 2001,
    '大海龟': 2002,
    '树怪': 2003,
    '海毛虫': 2004,
    '大蝙蝠': 2005,
    '羊头怪': 2006,
    '蛤蟆精': 2007,
    '狐狸精': 2008,
    '老虎': 2009,
    '黑熊': 2010,
    '花妖': 2011,
    '牛妖': 2012,
    '小龙女': 2013,
    '野鬼': 2014,
    '狼': 2015,
    '虾兵': 2016,
    '蟹将': 2017,
    '龟丞相': 2018,
    '兔子怪': 2019,
    '蜘蛛精': 2020,
    '黑熊精': 2021,
    '僵尸': 2022,
    '牛头': 2023,
    '马面': 2024,
    '雷鸟人': 2025,
    '蝴蝶仙子': 2026,
    '古代瑞兽': 2027,
    '白熊': 2028,
    '黑山老妖': 2029,
    '天兵': 2030,
    '天将': 2031,
    '地狱战神': 2032,
    '风伯': 2033,
    '凤凰': 2034,
    '蛟龙': 2035,
    '雨师': 2036,
    '如意仙子': 2037,
    '芙蓉仙子': 2038,
    '巡游天神': 2039,
    '星灵仙子': 2040
}

SumAttrs = {'physique': '体质', 'endurance': '耐力', 'dex': '敏捷', 'magic': '魔力', 'power': '力量'}

ServerTypes = {3: '3年以上服', 2: '1到3年服', 1: '1年内服'}

Gems = {1: '红玛瑙', 2: '太阳石', 3: '舍利子', 4: '光芒石', 5: '月亮石', 6: '黑宝石', 7: '神秘石', 12: '翡翠石'}

EquipAttrs160 = {1: '物理暴击几率', 2: '法术暴击几率', 3: '物理暴击伤害', 4: '法术暴击伤害', 5: '治疗能力', 6: '封印命中率', 7: '抵抗封印命中率', 8: '穿刺效果', 9: '格挡物理伤害', 10: '魔法回复', 11: '法术伤害减免效果'}

AddedAttr1 = {1: '固伤', 2: '伤害', 3: '速度', 4: '法术伤害', 5: '狂暴等级', 6: '物理暴击等级', 7: '法术暴击等级', 8: '封印命中等级', 90: '法术伤害结果', 10: '穿刺等级', 11: '治疗'}
AddedAttr2 = {12: '气血', 13: '防御', 14: '法防', 15: '抗物理暴击等级', 16: '抗法术暴击等级', 17: '抵抗封印命中等级', 18: '格挡', 19: '回复气血效果'}
#开服时间
KAIFU = {'梦回望月': 15, '梦回奔日': 15, '吉祥谷': 15, '飘香榭': 15, '珍宝阁': 15, '万胜府': 15, '欢乐谷': 15, '逍遥城': 15, '凌云殿': 15, '如意岛': 15, '映月湖': 15, '烟雨楼': 15, '大雁塔': 15, '牡丹亭': 15, '蓬莱岛': 15, '山海关': 15, '黄鹤楼': 15, '雄鹰岭': 15, '五台山': 15, '真武阁': 15, '鼓浪屿': 15, '紫禁城': 15, '城隍庙': 15, '青城山': 15, '锦绣园': 15, '金沙湾': 15, '白云山': 15, '东方明珠': 15, '六和塔': 15, '小雁塔': 15, '大观园': 15, '汇龙潭': 15, '少室山': 15, '晚芳亭': 15, '菩提岛': 15, '行吟阁': 15, '武夷山': 15, '状元坊': 15, '玄武湖': 15, '玉玲珑': 15, '文殊院': 15, '七星岩': 15, '天一阁': 14, '瘦西湖': 14, '缘聚唐城': 14, '仙人渡': 14, '物华天宝': 14, '九峰山': 14, '大明湖': 14, '神农架': 14, '庐山胜境': 14, '玉皇顶': 14, '花果山': 14, '桃花江': 14, '武当山': 14, '九寨沟': 14, '崂山仙境': 14, '太和殿': 14, '夫子庙': 14, '雷峰塔': 14, '普陀山': 14, '橘子洲': 14, '望海峰': 14, '雪域天龙': 14, '世界之窗': 14, '越秀山': 14, '青秀山': 14, '钟鼓楼': 14, '燕赵风云': 14, '北岳恒山': 14, '华夏': 14, '颐和园': 14, '刘公岛': 14, '雁荡山': 14, '雨花台': 14, '净月潭': 14, '神仙居': 14, '五亭桥': 14, '东岳泰山': 14, '清晖园': 14, '石景山': 14, '龙门石窟': 14, '慈光阁': 14, '仙女湖': 14, '彩云之南': 14, '侠客岛': 14, '九华山': 14, '岳阳楼': 14, '天津卫': 14, '钱塘江': 14, '火焰山': 14, '中岳嵩山': 14, '水泊梁山': 14, '白帝城': 14, '百花村': 14, '葫芦岛': 14, '解放碑': 14, '青山绿水': 14, '越王台': 14, '大梅沙': 14, '八角寨': 14, '鼎湖山': 14, '朝天门': 14, '五指山': 14, '梅雨潭': 14, '太清宫': 14, '开封府': 14, '王府井': 14, '牡丹江': 14, '锦秋湖': 14, '花样年华': 14, '嘉峪关': 14, '南天门': 14, '湖光岩': 14, '三潭印月': 13, '西岳华山': 13, '清源山': 13, '黄花岗': 13, '绍兴兰亭': 13, '锦绣中华': 13, '阳朔西街': 13, '商丘古城': 13, '烟雨南湖': 13, '襄阳城': 13, '汴梁城': 13, '虎丘山': 13, '沧州府': 13, '灵隐寺': 13, '扬美古镇': 13, '上海老街': 13, '趵突泉': 13, '光明顶': 13, '进贤门': 13, '南昆山': 13, '文昌阁': 13, '香格里拉': 13, '避暑山庄': 13, '朝歌城': 13, '嘉陵江': 13, '水帘洞': 13, '罗浮山': 13, '崇明岛': 13, '国子监': 13, '王屋山': 13, '精武门': 13, '镇海楼': 13, '洞庭湖': 13, '星海湾': 13, '沂州府': 13, '八闽游': 13, '小商桥': 13, '佟佳江': 13, '香蜜湖': 13, '桃花岛': 13, '湄洲岛': 13, '流溪河': 13, '碧海银沙': 13, '景德镇': 13, '台州湾': 13, '红枫湖': 13, '阳光城': 13, '逍遥津': 13, '大别山': 13, '白沙河': 13, '明秀园': 13, '卧龙岗': 13, '万绿湖': 13, '圆明园': 13, '燕塞湖': 13, '南澳岛': 13, '海棠溪': 13, '天马山': 12, '河姆渡': 12, '日光岩': 12, '流花湖': 12, '黄姚古镇': 12, '苏堤春晓': 12, '老龙湾': 12, '姑苏城': 12, '梅溪坊': 12, '长屿硐天': 12, '齐云楼': 12, '小梅沙': 12, '少林寺': 12, '赤壁古城': 12, '百草园': 12, '锦屏山': 12, '梧桐山': 12, '曲阜孔庙': 12, '桑浦山': 12, '南阳府': 12, '朱紫坊': 12, '医巫闾山': 12, '绍兴鉴湖': 12, '红叶谷': 12, '紫蓬山': 12, '五龙山': 12, '园博园': 12, '昭君台': 12, '德阳文庙': 12, '崇武古城': 12, '赵王城': 12, '成都府': 12, '雁门关': 12, '云天宫': 12, '南粤风采': 12, '东钱湖': 11, '渤海明珠': 11, '百花园': 11, '卫津河': 11, '天心阁': 11, '沙头角': 11, '金刀峡': 11, '西栅老街': 11, '蝴蝶泉': 11, '白马寺': 11, '浔阳楼': 11, '叠彩山': 11, '昆嵛山': 11, '栖霞山': 11, '平型关': 11, '春秋楼': 11, '爱晚亭': 10, '大名府': 10, '宝华山': 10, '沂水雪山': 10, '汴河洞': 10, '大东海': 10, '2008': 10, '梵净山': 10, '镇淮楼': 10, '醉翁亭': 10, '茶山竹海': 10, '戏马台': 10, '九里沟': 9, '天封塔': 9, '应天书院': 9, '静安寺': 9, '岱宗坊': 9, '龙潭古镇': 9, '陆家嘴': 9, '生日快乐': 9, '观星台': 9, '百丈�T': 9, '百狮坊': 9, '水立方': 9, '虎牢关': 8, '平湖秋月': 8, '月亮山': 8, '落霞水榭': 8, '凤凰城': 8, '海心塔': 8, '卧龙湖': 8, '海纳百川': 8, '似水流年': 8, '兰亭序': 8, '五彩池': 8, '跨时代': 8, '青花瓷': 8, '琅邪台': 8, '本草纲目': 8, '东风破': 8, '老君台': 8, '拙政园': 8, '七里香': 8, '九仙山': 8, '慕田峪': 8, '菊花台': 8, '迷迭香': 8, '珊瑚海': 8, '桃花源': 8, '千里之外': 7, '福昌阁': 7, '龙拳': 7, '将军': 7, '香炉峰': 7, '将军崖': 7, '亚圣府': 7, '聚仙谷': 7, '永乐宫': 7, '龙虎山': 7, '木兰围场': 7, '天堂寨': 7, '飞霞山': 7, '望江楼': 7, '灵岩古刹': 7, '天目山': 7, '大甲岛': 7, '松郡九峰': 7, '听涛轩': 7, '玉皇阁': 7, '西湖论剑': 7, '虎山长城': 7, '碧峰峡': 7, '大金湖': 7, '宝塔山': 7, '石鼓渡口': 7, '孟良崮': 7, '金山寺': 7, '陶然亭': 7, '三盘暮雨': 7, '林海雪原': 7, '黄埔港': 7, '伏牛山': 7, '清河坊': 7, '岳麓书院': 6, '昆仑关': 6, '八仙过海': 6, '龙门天关': 6, '徐家汇': 6, '云梦泽': 6, '黄龙府': 6, '钓鱼岛': 6, '满江红': 6, '沙坪坝': 6, '精卫填海': 6, '茅台古镇': 6, '荷塘月色': 6, '云水谣': 6, '浣纱溪': 6, '昭君出塞': 6, '妃子笑': 6, '渤海湾': 6, '白鹿书院': 6, '大亚湾': 6, '大连港': 6, '红旗渠': 6, '澜沧江': 6, '蓬莱阁': 6, '霸王别姬': 6, '甘露寺': 6, '剑门蜀道': 6, '铜雀台': 6, '什刹海': 6, '葛洲坝': 6, '莫干山': 6, '将军令': 6, '辽宁舰': 6, '金门风采': 6, '芙蓉镇': 6, '受禅台': 6, '二泉映月': 6, '小兴安岭': 6, '秋水长天': 5, '威海卫': 5, '桃园结义': 5, '九龙壁': 5, '吴淞口': 5, '碧海潮生': 5, '龙门峡': 5, '锦州港': 5, '香雪海': 5, '锦官城': 5, '彩云追月': 5, '汉魏故都': 5, '天柱山': 5, '青岛栈桥': 5, '桂林山水': 5, '南津关': 5, '舟山岛': 5, '轩辕台': 5, '居庸关': 5, '金陵城': 5, '凤凰台': 5, '广州湾': 5, '西关古镇': 5, '奉天府': 5, '上海外滩': 5, '东海崂山': 5, '武胜关': 5, '大渡河': 5, '南少林': 5, '临安城': 5, '秦皇岛': 5, '靖江王城': 5, '齐云山': 5, '万里长城': 5, '扬州城': 5, '西陵峡': 5, '凌烟阁': 5, '黄埔风云': 5, '洛阳城': 5, '外白渡桥': 5, '旅顺口': 5, '陌上桑': 5, '丹山赤水': 5, '喜大普奔': 5, '泗水泉林': 5, '对酒当歌': 5, '虎丘剑池': 5, '翡翠谷': 4, '讲武堂': 4, '龙马精神': 4, '青梅煮酒': 4, '缘定三生': 4, '凤求凰': 4, '北海银滩': 4, '长白天池': 4, '呼伦贝尔': 4, '文澜阁': 4, '胶东半岛': 4, '太行山': 4, '西山晴雪': 4, '百乐门': 4, '紫阳宫': 4, '鼋头渚': 4, '市阁凌霄': 4, '白水洋': 4, '石鼓书院': 4, '大凌河': 4, '群星璀璨': 4, '百里杜鹃': 4, '南屏山': 4, '国色天香': 4, '雁南飞': 4, '逐鹿中原': 4, '金戈铁马': 4, '三峡大坝': 4, '大世界': 4, '长安街': 4, '秦淮河': 4, '黄龙宝顶': 4, '风筝之都': 4, '漓江山水': 4, '巽寮湾': 4, '玉海楼': 4, '大红袍': 4, '鞍山千山': 4, '黄山云海': 4, '潇湘夜雨': 4, '轩辕城': 4, '司马台': 4, '灵山胜境': 4, '百脉泉': 4, '珠玑巷': 4, '佘山之巅': 4, '天策府': 3, '烟雨江南': 3, '晴川阁': 3, '泉州湾': 3, '狼山竞秀': 3, '锦江山': 3, '横琴岛': 3, '南京路': 3, '大相国寺': 3, '西湖龙井': 3, '景泰蓝': 3, '武汉东湖': 3, '太姥山': 3, '群雄逐鹿': 3, '东平湖': 3, '阅江楼': 3, '曲院风荷': 3, '君山银针': 3, '武灵丛台': 3, '浦东新区': 3, '恭王府': 3, '白鹅潭': 3, '东昌湖': 3, '钟山龙蟠': 3, '富春江': 3, '花岩溪': 3, '天竺山': 3, '天坛公园': 3, '蜀山竹海': 3, '唐三彩': 3, '孙子兵法': 3, '十里霓虹': 3, '碧螺春': 2, '黄龙吐翠': 2, '梦回长安': 2, '岭南风韵': 2, '逍遥三界': 2, '五道口': 2, '琅琊台': 2, '黄浦江': 2, '朝花夕拾': 2, '莫愁湖': 2, '诗情画意': 2, '比翼齐飞': 2, '梦想岛': 2, '青春如诗': 2, '超凡入圣': 2, '九如山': 2, '星梦高飞': 2, '国士无双': 2, '东方巨龙': 2, '长歌如梦': 2, '为爱追寻': 2, '逐梦青春': 2, '龙吟虎啸': 2, '功成名就': 2, '聚圣三界': 1, '百花齐放': 1, '花好月圆': 1, '万紫千红': 1, '风华绝代': 1, '天之骄子': 1, '华山论剑': 1, '繁花似锦': 1, '乘风破浪': 1, '古灵精怪': 1, '江苏1区': 1, '北京2区': 1, '浙江2区': 1, '上海2区': 1, '笑傲三界': 1, '山东2区': 1, '江苏2区': 1, '浙江4区': 1, '山东4区': 1, '河南1区': 1}